<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class IngredientsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('ingredients')->delete();
        
        \DB::table('ingredients')->insert(array (
            0 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 1,
                'name' => '4-メトキシサリチル酸カリウム塩',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            1 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 2,
                'name' => 'AHA',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            2 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 3,
                'name' => 'DHEA',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            3 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 4,
                'name' => 'L-システイン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            4 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 5,
                'name' => 'l-メントール',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            5 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 6,
                'name' => 't-フラバノン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            6 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 7,
                'name' => 'ε-アミノカプロン酸',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            7 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 8,
                'name' => 'アスコルビン酸',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            8 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 9,
                'name' => 'アスタキサンチン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            9 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 10,
                'name' => 'アダパレン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            10 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 11,
                'name' => 'アデノシン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            11 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 12,
                'name' => 'アラントイン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            12 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 13,
                'name' => 'アルジルリン®️',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            13 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 14,
                'name' => 'アルブチン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            14 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 15,
                'name' => 'イオウ',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            15 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 16,
                'name' => 'イソプロピルメチルフェノール',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            16 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 17,
                'name' => 'イブプロフェンピコノール',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            17 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 18,
                'name' => 'エラグ酸',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            18 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 19,
                'name' => 'カモミラET',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            19 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 20,
                'name' => 'グリチルリチン酸',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            20 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 21,
                'name' => 'ケトコナゾール',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            21 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 22,
                'name' => 'ゴールデンLP',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            22 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 23,
                'name' => 'コウジ酸',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            23 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 24,
                'name' => 'サリチル酸',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            24 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 25,
                'name' => 'セブラエン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            25 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 26,
                'name' => 'チオグリコール酸カルシウム',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            26 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 27,
                'name' => 'デュタステリド',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            27 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 28,
                'name' => 'トラネキサム酸',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            28 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 29,
                'name' => 'トレチノイン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            29 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 30,
                'name' => 'ナイアシンアミド',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            30 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 31,
                'name' => 'ニールワン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            31 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 32,
                'name' => 'ハイドロキノン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            32 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 33,
                'name' => 'パンテノール',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            33 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 34,
                'name' => 'パントテニルエチルエーテル',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            34 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 35,
                'name' => 'パントテン酸カルシウム',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            35 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 36,
                'name' => 'パントテン酸誘導体',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            36 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 37,
                'name' => 'ビオチン',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            37 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 38,
                'name' => 'ビタミンA',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            38 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 39,
                'name' => 'ビタミンB',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            39 => 
            array (
                'created_at' => '2021-12-15 20:12:30',
                'id' => 40,
                'name' => 'ビタミンC誘導体',
                'updated_at' => '2021-12-15 20:12:30',
            ),
            40 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 41,
                'name' => 'ビタミンE',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            41 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 42,
                'name' => 'ヒノキチオール',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            42 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 43,
                'name' => 'ピロクトンオラミン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            43 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 44,
                'name' => 'フィチン酸',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            44 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 45,
                'name' => 'フィナステリド',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            45 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 46,
                'name' => 'ヘパリン類似性物質',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            46 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 47,
                'name' => 'ホモスルファミン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            47 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 48,
                'name' => 'マグノリグナン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            48 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 49,
                'name' => 'ミコナゾール',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            49 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 50,
                'name' => 'ミノキシジル',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            50 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 51,
                'name' => 'ライスパワーNo.6エキス',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            51 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 52,
                'name' => 'ルシノール®',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            52 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 53,
                'name' => 'レチノール',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            53 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 54,
                'name' => '塩化ベンザルコニウム',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            54 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 55,
                'name' => '焼ミョウバン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            55 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 56,
                'name' => '葛の花由来イソフラボン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            56 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 57,
                'name' => '過酸化ベンゾイル',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            57 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 58,
                'name' => '酸化亜鉛',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            58 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 59,
                'name' => '防風通聖散',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            59 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 60,
                'name' => '難消化性デキストリン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            60 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 61,
                'name' => 'DADA',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            61 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 62,
                'name' => 'dl-カンフル',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            62 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 63,
                'name' => 'オレイン酸',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            63 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 64,
                'name' => 'グリチルリチン酸ジカリウム',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            64 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 65,
                'name' => 'クロルヒドロキシアルミニウム',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            65 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 66,
                'name' => 'ジンクピリチオン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            66 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 67,
                'name' => 'スピロノラクトン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            67 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 68,
                'name' => 'タマサキツヅラフジアルカロイド',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            68 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 69,
                'name' => 'ビタミンP',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            69 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 70,
                'name' => 'レゾルシン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            70 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 71,
                'name' => '塩化レボカルニチン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            71 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 72,
                'name' => 'α-リポ酸',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            72 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 73,
                'name' => 'エストロゲン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            73 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 74,
                'name' => 'テストステロン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            74 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 75,
                'name' => 'ペンタデカン',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            75 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 76,
                'name' => 'メトロニダゾール',
                'updated_at' => '2021-12-15 20:12:31',
            ),
            76 => 
            array (
                'created_at' => '2021-12-15 20:12:31',
                'id' => 77,
                'name' => 'リノール酸',
                'updated_at' => '2021-12-15 20:12:31',
            ),
        ));
        
        
    }
}